# REVERSAO DA TRANSFORMAÇÃO E DIFERENCIAÇÃO

In [1]:
# IMPORT DAS LIBRARIS
import pandas as pd
import numpy as np

In [2]:
# Dados
dados = pd.read_csv('AirPassengers.csv')
dados

       Month  #Passengers
0    1949-01          112
1    1949-02          118
2    1949-03          132
3    1949-04          129
4    1949-05          121
..       ...          ...
139  1960-08          606
140  1960-09          508
141  1960-10          461
142  1960-11          390
143  1960-12          432

[144 rows x 2 columns]

In [3]:
# Criando a serie
serie = pd.Series(dados['#Passengers'].values, index=dados['Month'])
serie

Month
1949-01    112
1949-02    118
1949-03    132
1949-04    129
1949-05    121
          ...
1960-08    606
1960-09    508
1960-10    461
1960-11    390
1960-12    432
Length: 144, dtype: int64

## Reversao da Transformacao por Logaritmo

In [4]:
# Transformando por log (Esse log e o logaritmo natural, tem base e)
serie2 = np.log(serie)
serie2

Month
1949-01    4.718499
1949-02    4.770685
1949-03    4.882802
1949-04    4.859812
1949-05    4.795791
             ...
1960-08    6.406880
1960-09    6.230481
1960-10    6.133398
1960-11    5.966147
1960-12    6.068426
Length: 144, dtype: float64

In [5]:
# Revertendo a serie
serie_revertida = np.e ** serie2
serie_revertida

Month
1949-01    112.0
1949-02    118.0
1949-03    132.0
1949-04    129.0
1949-05    121.0
           ...
1960-08    606.0
1960-09    508.0
1960-10    461.0
1960-11    390.0
1960-12    432.0
Length: 144, dtype: float64

In [6]:
# Logaritmo de base 10
serie10 = np.log10(serie)
serie10

Month
1949-01    2.049218
1949-02    2.071882
1949-03    2.120574
1949-04    2.110590
1949-05    2.082785
             ...
1960-08    2.782473
1960-09    2.705864
1960-10    2.663701
1960-11    2.591065
1960-12    2.635484
Length: 144, dtype: float64

In [7]:
# Revertendo a serie de base10
serie_revertida10 = 10 ** serie10
serie_revertida10

Month
1949-01    112.0
1949-02    118.0
1949-03    132.0
1949-04    129.0
1949-05    121.0
           ...
1960-08    606.0
1960-09    508.0
1960-10    461.0
1960-11    390.0
1960-12    432.0
Length: 144, dtype: float64

## Reversao da Transformacao por Raiz Cubica

In [8]:
# Transformacao por raiz cubica (quando possui dados com valor zero ou negativos)
serie3 = (serie) ** (1/3)
serie3

Month
1949-01    4.820285
1949-02    4.904868
1949-03    5.091643
1949-04    5.052774
1949-05    4.946087
             ...
1960-08    8.462348
1960-09    7.979112
1960-10    7.725032
1960-11    7.306144
1960-12    7.559526
Length: 144, dtype: float64

In [9]:
# Revertendo a Serie3
reverte_serie3 = serie3 ** 3
reverte_serie3

Month
1949-01    112.0
1949-02    118.0
1949-03    132.0
1949-04    129.0
1949-05    121.0
           ...
1960-08    606.0
1960-09    508.0
1960-10    461.0
1960-11    390.0
1960-12    432.0
Length: 144, dtype: float64

## Reversao da Diferenciacao

In [10]:
# Criando a serie diferenciada 
serie_diferenciada = serie.diff()
serie_diferenciada

Month
1949-01     NaN
1949-02     6.0
1949-03    14.0
1949-04    -3.0
1949-05    -8.0
           ...
1960-08   -16.0
1960-09   -98.0
1960-10   -47.0
1960-11   -71.0
1960-12    42.0
Length: 144, dtype: float64

In [11]:
# Serie Difirenciada revertida
serie_dif_revertida = serie.shift(1) + serie_diferenciada
serie_dif_revertida

Month
1949-01      NaN
1949-02    118.0
1949-03    132.0
1949-04    129.0
1949-05    121.0
           ...
1960-08    606.0
1960-09    508.0
1960-10    461.0
1960-11    390.0
1960-12    432.0
Length: 144, dtype: float64

## Organizando em um DataFrame

#### Fazer a diferenciacao dos valores que estao na coluna #Passengers e criar uma coluna no DataFrame com o nome: Valores_diferenciados

In [12]:
dados['valores_diferenciados'] = dados['#Passengers'].diff()
dados

       Month  #Passengers  valores_diferenciados
0    1949-01          112                    NaN
1    1949-02          118                    6.0
2    1949-03          132                   14.0
3    1949-04          129                   -3.0
4    1949-05          121                   -8.0
..       ...          ...                    ...
139  1960-08          606                  -16.0
140  1960-09          508                  -98.0
141  1960-10          461                  -47.0
142  1960-11          390                  -71.0
143  1960-12          432                   42.0

[144 rows x 3 columns]

#### Reverte a diferenciacao da coluna valores_diferenciados e criar mais uma coluna no Dataframe com o nome: valores_revertidos

In [13]:
dados['valores_revertidos'] = dados['#Passengers'].shift(1) + dados['valores_diferenciados']
dados

       Month  #Passengers  valores_diferenciados  valores_revertidos
0    1949-01          112                    NaN                 NaN
1    1949-02          118                    6.0               118.0
2    1949-03          132                   14.0               132.0
3    1949-04          129                   -3.0               129.0
4    1949-05          121                   -8.0               121.0
..       ...          ...                    ...                 ...
139  1960-08          606                  -16.0               606.0
140  1960-09          508                  -98.0               508.0
141  1960-10          461                  -47.0               461.0
142  1960-11          390                  -71.0               390.0
143  1960-12          432                   42.0               432.0

[144 rows x 4 columns]